### **Avance 2 - Proyecto Final**

In [3]:
from src.db.database import DBConnection
db1 = DBConnection()

In [4]:
# Ejecutar una query con df
query = """
select FirstName as Nombre, LastName as Apellido, Gender as Genero, HireDate as FechaContratacion,
CityName as Ciudad, CountryName as Pais from employees e join cities c on e.cityid = c.cityid
join countries co on c.countryID= co.countryID LIMIT 5;
"""
df = db1.execute_query(query)
df

2025-06-02 11:46:12,963 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2025-06-02 11:46:12,963 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-02 11:46:12,968 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2025-06-02 11:46:12,969 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-02 11:46:12,970 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2025-06-02 11:46:12,971 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-02 11:46:12,973 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-02 11:46:12,973 INFO sqlalchemy.engine.Engine
select FirstName as Nombre, LastName as Apellido, Gender as Genero, HireDate as FechaContratacion,
CityName as Ciudad, CountryName as Pais from employees e join cities c on e.cityid = c.cityid
join countries co on c.countryID= co.countryID LIMIT 5;

2025-06-02 11:46:12,974 INFO sqlalchemy.engine.Engine [generated in 0.00130s] {}
2025-06-02 11:46:12,977 INFO sqlalchemy.engine.Engine ROLLBACK

      Nombre Apellido Genero   FechaContratacion       Ciudad           Pais
0     Nicole   Fuller      F 2011-06-20 07:15:37  New Orleans  United States
1  Christine   Palmer      F 2011-04-27 04:07:57      Fremont  United States
2      Pablo    Cline      M 2012-03-30 18:55:23    Rochester  United States
3    Darnell  Nielsen      M 2014-03-06 06:55:03      Lubbock  United States
4    Desiree   Stuart      F 2014-11-16 22:59:55      Anaheim  United States

### **Patrones de diseño**

**Patron Singleton**

In [5]:
## Verificar Patron Singleton

db1 = DBConnection()
db2 = DBConnection()

print("Es la misma instancia?", db1 is db2)
print("Es la misma base de datos?", db1.engine.url == db2.engine.url)

Es la misma instancia? True
Es la misma base de datos? True

In [4]:
from src.design_patterns.factory import CustomerFactory
from src.design_patterns.factory import EmployeeFactory

db = DBConnection()

**Patron Factory**

In [7]:
## Implementación del patrón Factory

## Customer Factory

df = db.execute_query("Select * from customers limit 10")

customers = [CustomerFactory.from_series(row) for _, row in df.iterrows()]

customers[0].__dict__

2025-06-02 11:46:35,333 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-02 11:46:35,334 INFO sqlalchemy.engine.Engine Select * from customers limit 10
2025-06-02 11:46:35,334 INFO sqlalchemy.engine.Engine [generated in 0.00201s] {}
2025-06-02 11:46:35,336 INFO sqlalchemy.engine.Engine ROLLBACK

{'_sa_instance_state': <sqlalchemy.orm.state.InstanceState at 0x1cbd86885f0>,
 'CustomerID': 1,
 'FirstName': 'Stefanie',
 'MiddleInitial': 'Y',
 'LastName': 'Frye',
 'CityID': 79,
 'Address': '97 Oak Avenue'}

In [8]:
## Implementación del patrón Factory

## Employee Factory

df = db.execute_query("Select * from employees limit 10")
print(df.columns.to_list())

employees = [EmployeeFactory.from_series(row) for _, row in df.iterrows()]

employees[0].__dict__

2025-06-02 11:46:39,349 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-02 11:46:39,349 INFO sqlalchemy.engine.Engine Select * from employees limit 10
2025-06-02 11:46:39,350 INFO sqlalchemy.engine.Engine [generated in 0.00139s] {}
2025-06-02 11:46:39,352 INFO sqlalchemy.engine.Engine ROLLBACK
['EmployeeID', 'Firstname', 'MiddleInitial', 'LastName', 'BirthDate', 'Gender', 'CityID', 'HireDate']

{'_sa_instance_state': <sqlalchemy.orm.state.InstanceState at 0x1cbd8689190>,
 'EmployeeID': 1,
 'FirstName': 'Nicole',
 'MiddleInitial': 'T',
 'LastName': 'Fuller',
 'BirthDate': datetime.date(1981, 3, 7),
 'Gender': 'F',
 'CityID': 80,
 'HireDate': Timestamp('2011-06-20 07:15:37')}

In [19]:
## Implementación del patrón Strategy

query = """
select * from sales s join employees e on s.salespersonID = e.employeeID;
"""
df = db1.execute_query(query)

2025-06-03 15:52:14,251 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-03 15:52:14,253 INFO sqlalchemy.engine.Engine
select * from sales s join employees e on s.salespersonID = e.employeeID;

2025-06-03 15:52:14,254 INFO sqlalchemy.engine.Engine [cached since 699.9s ago] {}
2025-06-03 15:52:14,849 INFO sqlalchemy.engine.Engine ROLLBACK

In [39]:
from src.design_patterns.strategy import TotalSalesByEmployee

report = TotalSalesByEmployee()
report.generate_report(df,"TotalPrice")

    IDVendedor     Nombre   Apellido TotalVentas
0           23      Janet    Flowers   665091.00
1           22      Tonia  Mc Millan   631158.00
2           21      Devon     Brewer   618744.00
3           20     Shelby     Riddle   569220.00
4           19    Bernard      Moody   538954.00
5           18     Warren   Bartlett   512154.00
6           17       Seth     Franco   463658.00
7           16   Chadwick     Walton   458800.00
8           15       Kari     Finley   416940.00
9           14      Wendi    Buckley   406812.00
10          13     Katina      Marks   368511.00
11          12    Lindsay       Chen   338664.00
12          11      Sonya    Dickson   308726.00
13          10       Jean       Vang   284590.00
14           9     Daphne       King   251775.00
15           8      Julie       Dyer   241680.00
16           7   Chadwick       Cook   195111.00
17           6      Holly    Collins   171600.00
18           5    Desiree     Stuart   140985.00
19           4    Darnell    Nielsen   110060.00
20           3      Pablo      Cline    83925.00
21           2  Christine     Palmer    58174.00
22           1     Nicole     Fuller    28287.00

In [40]:
from src.design_patterns.strategy import AverageSalesByEmployee
report = AverageSalesByEmployee()
report.generate_report(df,"TotalPrice")

    IDVendedor     Nombre   Apellido Promedio de ventas
0           23      Janet    Flowers         303.694521
1           22      Tonia  Mc Millan         292.202778
2           21      Devon     Brewer         275.241993
3           20     Shelby     Riddle         263.040665
4           19    Bernard      Moody         249.746988
5           18     Warren   Bartlett         232.269388
6           17       Seth     Franco         221.633843
7           16   Chadwick     Walton         208.072562
8           15       Kari     Finley         197.414773
9           14      Wendi    Buckley         181.450491
10          13     Katina      Marks          169.27469
11          12    Lindsay       Chen         156.210332
12          11      Sonya    Dickson         143.460037
13          10       Jean       Vang         130.605782
14           9     Daphne       King         116.941477
15           8      Julie       Dyer         106.326441
16           7   Chadwick       Cook          91.903439
17           6      Holly    Collins          78.499543
18           5    Desiree     Stuart               65.0
19           4    Darnell    Nielsen          52.037825
20           3      Pablo      Cline          39.662098
21           2  Christine     Palmer          25.832149
22           1     Nicole     Fuller          13.089773

In [41]:
from src.design_patterns.strategy import TopProductSalesByEmployee
report = TopProductSalesByEmployee()
report.generate_report(df, "ProductID")

    IDVendedor     Nombre   Apellido  Producto mas vendido
0            8      Julie       Dyer                  2273
1            2  Christine     Palmer                  2252
2           21      Devon     Brewer                  2248
3           14      Wendi    Buckley                  2242
4           16   Chadwick     Walton                  2205
5           18     Warren   Bartlett                  2205
6           23      Janet    Flowers                  2190
7            6      Holly    Collins                  2186
8           10       Jean       Vang                  2179
9           13     Katina      Marks                  2177
10           5    Desiree     Stuart                  2169
11          12    Lindsay       Chen                  2168
12          20     Shelby     Riddle                  2164
13           1     Nicole     Fuller                  2161
14          22      Tonia  Mc Millan                  2160
15          19    Bernard      Moody                  2158
16           9     Daphne       King                  2153
17          11      Sonya    Dickson                  2152
18           7   Chadwick       Cook                  2123
19           3      Pablo      Cline                  2116
20           4    Darnell    Nielsen                  2115
21          15       Kari     Finley                  2112
22          17       Seth     Franco                  2092

In [38]:
import importlib
import src.design_patterns.strategy
importlib.reload(src.design_patterns.strategy)